In [4]:
import pandas as pd
pd.__version__

'1.0.1'

# Creating series in pandas

In [6]:
name = pd.Series(['waqar','yawar','ali','haider'])
name

0     waqar
1     yawar
2       ali
3    haider
dtype: object

In [15]:
marks = pd.Series([98,88,44,12,15], index= ['ali','ahmed','ibrar','Joe','Steve'], dtype = float , name = "Marks" )
marks

ali      98.0
ahmed    88.0
ibrar    44.0
Joe      12.0
Steve    15.0
Name: Marks, dtype: float64

In [24]:
print(min(marks))
print(max(marks))
print(marks['Joe'])
print(marks[1])
print(marks['ali':'Steve'])

12.0
98.0
12.0
88.0
ali      98.0
ahmed    88.0
ibrar    44.0
Joe      12.0
Steve    15.0
Name: Marks, dtype: float64

# creating a dataframe

In [30]:
mark_sheet = pd.DataFrame({'math':[100, 30, 55], 'physics':[14, 78, 35,], 'comp':[14, 55, 32,]}, index = ['ali','ahmed','abdullah'])
mark_sheet

          math  physics  comp
ali        100       14    14
ahmed       30       78    55
abdullah    55       35    32

In [34]:
print(mark_sheet.loc['ali'])

math       100
physics     14
comp        14
Name: ali, dtype: int64

In [35]:
mark_sheet[mark_sheet > 44]

           math  physics  comp
ali       100.0      NaN   NaN
ahmed       NaN     78.0  55.0
abdullah   55.0      NaN   NaN